ImBonkers/nuttx/arch/arm/src/stm32n6/hardware/stm32n6xxx_otg.h
/****************************************************************************
 * arch/arm/src/stm32n6/hardware/stm32n6xxx_otg.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_STM32N6_HARDWARE_STM32N6XXX_OTG_H
#define __ARCH_ARM_SRC_STM32N6_HARDWARE_STM32N6XXX_OTG_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* General definitions */

#define OTG_EPTYPE_CTRL               (0) /* Control */
#define OTG_EPTYPE_ISOC               (1) /* Isochronous */
#define OTG_EPTYPE_BULK               (2) /* Bulk */
#define OTG_EPTYPE_INTR               (3) /* Interrupt */

#define OTG_PID_DATA0                 (0)
#define OTG_PID_DATA2                 (1)
#define OTG_PID_DATA1                 (2)
#define OTG_PID_MDATA                 (3) /* Non-control */
#define OTG_PID_SETUP                 (3) /* Control */

/* Register Offsets *********************************************************/

/* Core global control and status registers */

#define STM32_OTG_GOTGCTL_OFFSET      0x0000 /* Control and status register */
#define STM32_OTG_GOTGINT_OFFSET      0x0004 /* Interrupt register */
#define STM32_OTG_GAHBCFG_OFFSET      0x0008 /* AHB configuration register */
#define STM32_OTG_GUSBCFG_OFFSET      0x000c /* USB configuration register */
#define STM32_OTG_GRSTCTL_OFFSET      0x0010 /* Reset register */
#define STM32_OTG_GINTSTS_OFFSET      0x0014 /* Core interrupt register */
#define STM32_OTG_GINTMSK_OFFSET      0x0018 /* Interrupt mask register */
#define STM32_OTG_GRXSTSR_OFFSET      0x001c /* Receive status debug read/OTG status read register */
#define STM32_OTG_GRXSTSP_OFFSET      0x0020 /* Receive status debug read/OTG status pop register */
#define STM32_OTG_GRXFSIZ_OFFSET      0x0024 /* Receive FIFO size register */
#define STM32_OTG_HNPTXFSIZ_OFFSET    0x0028 /* Host non-periodic transmit FIFO size register */
#define STM32_OTG_DIEPTXF0_OFFSET     0x0028 /* Endpoint 0 Transmit FIFO size */
#define STM32_OTG_HNPTXSTS_OFFSET     0x002c /* Non-periodic transmit FIFO/queue status register */
#define STM32_OTG_GCCFG_OFFSET        0x0038 /* General core configuration register */
#define STM32_OTG_CID_OFFSET          0x003c /* Core ID register  */
#define STM32_OTG_HPTXFSIZ_OFFSET     0x0100 /* Host periodic transmit FIFO size register */

#define STM32_OTG_DIEPTXF_OFFSET(n)   (0x0104+(((n)-1) << 2))

/* Host-mode control and status registers */

#define STM32_OTG_HCFG_OFFSET         0x0400 /* Host configuration register */
#define STM32_OTG_HFIR_OFFSET         0x0404 /* Host frame interval register */
#define STM32_OTG_HFNUM_OFFSET        0x0408 /* Host frame number/frame time remaining register */
#define STM32_OTG_HPTXSTS_OFFSET      0x0410 /* Host periodic transmit FIFO/queue status register */
#define STM32_OTG_HAINT_OFFSET        0x0414 /* Host all channels interrupt register */
#define STM32_OTG_HAINTMSK_OFFSET     0x0418 /* Host all channels interrupt mask register */
#define STM32_OTG_HPRT_OFFSET         0x0440 /* Host port control and status register */

#define STM32_OTG_CHAN_OFFSET(n)      (0x500 + ((n) << 5)
#define STM32_OTG_HCCHAR_CHOFFSET     0x0000 /* Host channel characteristics register */
#define STM32_OTG_HCINT_CHOFFSET      0x0008 /* Host channel interrupt register */
#define STM32_OTG_HCINTMSK_CHOFFSET   0x000c /* Host channel interrupt mask register */
#define STM32_OTG_HCTSIZ_CHOFFSET     0x0010 /* Host channel interrupt register */

#define STM32_OTG_HCCHAR_OFFSET(n)    (0x500 + ((n) << 5))

#define STM32_OTG_HCINT_OFFSET(n)     (0x508 + ((n) << 5))

#define STM32_OTG_HCINTMSK_OFFSET(n)  (0x50c + ((n) << 5))

#define STM32_OTG_HCTSIZ_OFFSET(n)    (0x510 + ((n) << 5))

/* Device-mode control and status registers */

#define STM32_OTG_DCFG_OFFSET         0x0800 /* Device configuration register */
#define STM32_OTG_DCTL_OFFSET         0x0804 /* Device control register */
#define STM32_OTG_DSTS_OFFSET         0x0808 /* Device status register */
#define STM32_OTG_DIEPMSK_OFFSET      0x0810 /* Device IN endpoint common interrupt mask register */
#define STM32_OTG_DOEPMSK_OFFSET      0x0814 /* Device OUT endpoint common interrupt mask register */
#define STM32_OTG_DAINT_OFFSET        0x0818 /* Device all endpoints interrupt register */
#define STM32_OTG_DAINTMSK_OFFSET     0x081c /* All endpoints interrupt mask register */
#define STM32_OTG_DVBUSDIS_OFFSET     0x0828 /* Device VBUS discharge time register */
#define STM32_OTG_DVBUSPULSE_OFFSET   0x082c /* Device VBUS pulsing time register */
#define STM32_OTG_DIEPEMPMSK_OFFSET   0x0834 /* Device IN endpoint FIFO empty interrupt mask register */

#define STM32_OTG_DIEP_OFFSET(n)      (0x0900 + ((n) << 5))
#define STM32_OTG_DIEPCTL_EPOFFSET    0x0000 /* Device endpoint control register */
#define STM32_OTG_DIEPINT_EPOFFSET    0x0008 /* Device endpoint interrupt register */
#define STM32_OTG_DIEPTSIZ_EPOFFSET   0x0010 /* Device IN endpoint transfer size register */
#define STM32_OTG_DTXFSTS_EPOFFSET    0x0018 /* Device IN endpoint transmit FIFO status register */

#define STM32_OTG_DIEPCTL_OFFSET(n)   (0x0900 + ((n) << 5))

