ImBonkers/nuttx/arch/arm/src/stm32n6/hardware/stm32n6xxx_otg.h
#define STM32_OTG_DIEPINT_OFFSET(n)   (0x0908 + ((n) << 5))

#define STM32_OTG_DIEPTSIZ_OFFSET(n)  (0x910 + ((n) << 5))

#define STM32_OTG_DIEPDMA_OFFSET(n)   (0x0914 + ((n) << 5))

#define STM32_OTG_DTXFSTS_OFFSET(n)   (0x0918 + ((n) << 5))

#define STM32_OTG_DOEP_OFFSET(n)      (0x0b00 + ((n) << 5))
#define STM32_OTG_DOEPCTL_EPOFFSET    0x0000 /* Device control OUT endpoint 0 control register */
#define STM32_OTG_DOEPINT_EPOFFSET    0x0008 /* Device endpoint-x interrupt register */

#define STM32_OTG_DOEPCTL_OFFSET(n)   (0x0b00 + ((n) << 5))

#define STM32_OTG_DOEPINT_OFFSET(n)   (0x0b08 + ((n) << 5))

#define STM32_OTG_DOEPTSIZ_OFFSET(n)  (0x0b10 + ((n) << 5))

#define STM32_OTG_DOEPDMA_OFFSET(n)   (0x0b14 + ((n) << 5))

/* Power and clock gating registers */

#define STM32_OTG_PCGCCTL_OFFSET      0x0e00 /* Power and clock gating control register */

/* Data FIFO (DFIFO) access registers */

#define STM32_OTG_DFIFO_DEP_OFFSET(n) (0x1000 + ((n) << 12))
#define STM32_OTG_DFIFO_HCH_OFFSET(n) (0x1000 + ((n) << 12))

/* Register Addresses *******************************************************/

#define STM32_OTG_GOTGCTL             (STM32_OTG_BASE+STM32_OTG_GOTGCTL_OFFSET)
#define STM32_OTG_GOTGINT             (STM32_OTG_BASE+STM32_OTG_GOTGINT_OFFSET)
#define STM32_OTG_GAHBCFG             (STM32_OTG_BASE+STM32_OTG_GAHBCFG_OFFSET)
#define STM32_OTG_GUSBCFG             (STM32_OTG_BASE+STM32_OTG_GUSBCFG_OFFSET)
#define STM32_OTG_GRSTCTL             (STM32_OTG_BASE+STM32_OTG_GRSTCTL_OFFSET)
#define STM32_OTG_GINTSTS             (STM32_OTG_BASE+STM32_OTG_GINTSTS_OFFSET)
#define STM32_OTG_GINTMSK             (STM32_OTG_BASE+STM32_OTG_GINTMSK_OFFSET)
#define STM32_OTG_GRXSTSR             (STM32_OTG_BASE+STM32_OTG_GRXSTSR_OFFSET)
#define STM32_OTG_GRXSTSP             (STM32_OTG_BASE+STM32_OTG_GRXSTSP_OFFSET)
#define STM32_OTG_GRXFSIZ             (STM32_OTG_BASE+STM32_OTG_GRXFSIZ_OFFSET)
#define STM32_OTG_HNPTXFSIZ           (STM32_OTG_BASE+STM32_OTG_HNPTXFSIZ_OFFSET)
#define STM32_OTG_DIEPTXF0            (STM32_OTG_BASE+STM32_OTG_DIEPTXF0_OFFSET)
#define STM32_OTG_HNPTXSTS            (STM32_OTG_BASE+STM32_OTG_HNPTXSTS_OFFSET)
#define STM32_OTG_GCCFG               (STM32_OTG_BASE+STM32_OTG_GCCFG_OFFSET)
#define STM32_OTG_CID                 (STM32_OTG_BASE+STM32_OTG_CID_OFFSET)
#define STM32_OTG_HPTXFSIZ            (STM32_OTG_BASE+STM32_OTG_HPTXFSIZ_OFFSET)

#define STM32_OTG_DIEPTXF(n)          (STM32_OTG_BASE+STM32_OTG_DIEPTXF_OFFSET(n))

/* Host-mode control and status registers */

#define STM32_OTG_HCFG                (STM32_OTG_BASE+STM32_OTG_HCFG_OFFSET)
#define STM32_OTG_HFIR                (STM32_OTG_BASE+STM32_OTG_HFIR_OFFSET)
#define STM32_OTG_HFNUM               (STM32_OTG_BASE+STM32_OTG_HFNUM_OFFSET)
#define STM32_OTG_HPTXSTS             (STM32_OTG_BASE+STM32_OTG_HPTXSTS_OFFSET)
#define STM32_OTG_HAINT               (STM32_OTG_BASE+STM32_OTG_HAINT_OFFSET)
#define STM32_OTG_HAINTMSK            (STM32_OTG_BASE+STM32_OTG_HAINTMSK_OFFSET)
#define STM32_OTG_HPRT                (STM32_OTG_BASE+STM32_OTG_HPRT_OFFSET)

#define STM32_OTG_CHAN(n)             (STM32_OTG_BASE+STM32_OTG_CHAN_OFFSET(n))

#define STM32_OTG_HCCHAR(n)           (STM32_OTG_BASE+STM32_OTG_HCCHAR_OFFSET(n))

#define STM32_OTG_HCINT(n)            (STM32_OTG_BASE+STM32_OTG_HCINT_OFFSET(n))

#define STM32_OTG_HCINTMSK(n)         (STM32_OTG_BASE+STM32_OTG_HCINTMSK_OFFSET(n))

#define STM32_OTG_HCTSIZ(n)           (STM32_OTG_BASE+STM32_OTG_HCTSIZ_OFFSET(n))

/* Device-mode control and status registers */

#define STM32_OTG_DCFG                (STM32_OTG_BASE+STM32_OTG_DCFG_OFFSET)
#define STM32_OTG_DCTL                (STM32_OTG_BASE+STM32_OTG_DCTL_OFFSET)
#define STM32_OTG_DSTS                (STM32_OTG_BASE+STM32_OTG_DSTS_OFFSET)
#define STM32_OTG_DIEPMSK             (STM32_OTG_BASE+STM32_OTG_DIEPMSK_OFFSET)
#define STM32_OTG_DOEPMSK             (STM32_OTG_BASE+STM32_OTG_DOEPMSK_OFFSET)
#define STM32_OTG_DAINT               (STM32_OTG_BASE+STM32_OTG_DAINT_OFFSET)
#define STM32_OTG_DAINTMSK            (STM32_OTG_BASE+STM32_OTG_DAINTMSK_OFFSET)
#define STM32_OTG_DVBUSDIS            (STM32_OTG_BASE+STM32_OTG_DVBUSDIS_OFFSET)
#define STM32_OTG_DVBUSPULSE          (STM32_OTG_BASE+STM32_OTG_DVBUSPULSE_OFFSET)
#define STM32_OTG_DIEPEMPMSK          (STM32_OTG_BASE+STM32_OTG_DIEPEMPMSK_OFFSET)

#define STM32_OTG_DIEP(n)             (STM32_OTG_BASE+STM32_OTG_DIEP_OFFSET(n))

#define STM32_OTG_DIEPCTL(n)          (STM32_OTG_BASE+STM32_OTG_DIEPCTL_OFFSET(n))

#define STM32_OTG_DIEPINT(n)          (STM32_OTG_BASE+STM32_OTG_DIEPINT_OFFSET(n))

#define STM32_OTG_DIEPTSIZ(n)         (STM32_OTG_BASE+STM32_OTG_DIEPTSIZ_OFFSET(n))

#define STM32_OTG_DIEPDMA(n)          (STM32_OTG_BASE+STM32_OTG_DIEPDMA_OFFSET(n))

#define STM32_OTG_DTXFSTS(n)          (STM32_OTG_BASE+STM32_OTG_DTXFSTS_OFFSET(n))

#define STM32_OTG_DOEP(n)             (STM32_OTG_BASE+STM32_OTG_DOEP_OFFSET(n))

#define STM32_OTG_DOEPCTL(n)          (STM32_OTG_BASE+STM32_OTG_DOEPCTL_OFFSET(n))

#define STM32_OTG_DOEPINT(n)          (STM32_OTG_BASE+STM32_OTG_DOEPINT_OFFSET(n))

#define STM32_OTG_DOEPTSIZ(n)         (STM32_OTG_BASE+STM32_OTG_DOEPTSIZ_OFFSET(n))

#define STM32_OTG_DOEPDMA(n)          (STM32_OTG_BASE+STM32_OTG_DOEPDMA_OFFSET(n))

/* Power and clock gating registers */

#define STM32_OTG_PCGCCTL             (STM32_OTG_BASE+STM32_OTG_PCGCCTL_OFFSET)

/* Data FIFO (DFIFO) access registers */

#define STM32_OTG_DFIFO_DEP(n)        (STM32_OTG_BASE+STM32_OTG_DFIFO_DEP_OFFSET(n))
#define STM32_OTG_DFIFO_HCH(n)        (STM32_OTG_BASE+STM32_OTG_DFIFO_HCH_OFFSET(n))

/* Register Bitfield Definitions ********************************************/

/* Core global control and status registers */

/* Control and status register */

#define OTG_GOTGCTL_SRQSCS            (1 << 0)  /* Bit 0:  Session request success */
#define OTG_GOTGCTL_SRQ               (1 << 1)  /* Bit 1:  Session request */
#define OTG_GOTGCTL_VBVALOEN          (1 << 2)  /* Bit 2:  VBUS valid override enable */
#define OTG_GOTGCTL_VBVALOVAL         (1 << 3)  /* Bit 3:  VBUS valid override value */
#define OTG_GOTGCTL_AVALOEN           (1 << 4)  /* Bit 4:  A-peripheral session valid override enable */
#define OTG_GOTGCTL_AVALOVAL          (1 << 5)  /* Bit 5:  A-peripheral session valid override value */
#define OTG_GOTGCTL_BVALOEN           (1 << 6)  /* Bit 6:  B-peripheral session valid override enable */
#define OTG_GOTGCTL_BVALOVAL          (1 << 7)  /* Bit 7:  B-peripheral session valid override value  */
#define OTG_GOTGCTL_HNGSCS            (1 << 8)  /* Bit 8:  Host negotiation success */
#define OTG_GOTGCTL_HNPRQ             (1 << 9)  /* Bit 9:  HNP request */
#define OTG_GOTGCTL_HSHNPEN           (1 << 10) /* Bit 10: host set HNP enable */
#define OTG_GOTGCTL_DHNPEN            (1 << 11) /* Bit 11: Device HNP enabled */
#define OTG_GOTGCTL_EHEN              (1 << 12) /* Bit 12: Embedded host enable */
                                                /* Bits 13-15: Reserved */
#define OTG_GOTGCTL_CIDSTS            (1 << 16) /* Bit 16: Connector ID status */
#define OTG_GOTGCTL_DBCT              (1 << 17) /* Bit 17: Long/short debounce time */
#define OTG_GOTGCTL_ASVLD             (1 << 18) /* Bit 18: A-session valid */
#define OTG_GOTGCTL_BSVLD             (1 << 19) /* Bit 19: B-session valid */
#define OTG_GOTGCTL_OTGVER            (1 << 20) /* Bit 20: OTG version */
                                                /* Bits 21-31: Reserved */

