ImBonkers/nuttx/arch/arm/src/stm32n6/hardware/stm32n6xxx_otg.h
/* Interrupt register */

                                                /* Bits 1-0 Reserved */
#define OTG_GOTGINT_SEDET             (1 << 2)  /* Bit 2: Session end detected */
                                                /* Bits 3-7: Reserved */
#define OTG_GOTGINT_SRSSCHG           (1 << 8)  /* Bit 8: Session request success status change */
#define OTG_GOTGINT_HNSSCHG           (1 << 9)  /* Bit 9: Host negotiation success status change */
                                                /* Bits 16-10 Reserved */
#define OTG_GOTGINT_HNGDET            (1 << 17) /* Bit 17: Host negotiation detected */
#define OTG_GOTGINT_ADTOCHG           (1 << 18) /* Bit 18: A-device timeout change */
#define OTG_GOTGINT_DBCDNE            (1 << 19) /* Bit 19: Debounce done */
#define OTG_GOTGINT_IDCHNG            (1 << 20) /* Bit 20: Change in ID pin input value */
                                                /* Bits 21-31: Reserved */

/* AHB configuration register */

#define OTG_GAHBCFG_GINTMSK           (1 << 0)  /* Bit 0: Global interrupt mask */
#define OTG_GAHBCFG_HBSTLEN_SHIFT     (1)       /* Bits 1-4: Bust length/type */
#  define OTG_GAHBCFG_HBSTLEN_MASK    (0xf << OTG_GAHBCFG_HBSTLEN_SHIFT)
#define OTG_GAHBCFG_DMAEN             (1 << 5)  /* Bit 5: DMA enable */
                                                /* Bit 6: Reserved */
#define OTG_GAHBCFG_TXFELVL           (1 << 7)  /* Bit 7: TxFIFO empty level */
#define OTG_GAHBCFG_PTXFELVL          (1 << 8)  /* Bit 8: Periodic TxFIFO empty level */
                                                /* Bits 20-31: Reserved */

/* USB configuration register */

#define OTG_GUSBCFG_TOCAL_SHIFT       (0)       /* Bits 0-2: FS timeout calibration */
#define OTG_GUSBCFG_TOCAL_MASK        (7 << OTG_GUSBCFG_TOCAL_SHIFT)
                                                /* Bits 3-5: Reserved */
#define OTG_GUSBCFG_PHYSEL            (1 << 6)  /* Bit 6: Full Speed serial transceiver select */
                                                /* Bit 7: Reserved */
#define OTG_GUSBCFG_SRPCAP            (1 << 8)  /* Bit 8: SRP-capable */
#define OTG_GUSBCFG_HNPCAP            (1 << 9)  /* Bit 9: HNP-capable */
#define OTG_GUSBCFG_TRDT_SHIFT        (10)      /* Bits 10-13: USB turnaround time */
#define OTG_GUSBCFG_TRDT_MASK         (15 << OTG_GUSBCFG_TRDT_SHIFT)
#  define OTG_GUSBCFG_TRDT(n)         ((n) << OTG_GUSBCFG_TRDT_SHIFT)
                                                /* Bit 14: Reserved */
#define OTG_GUSBCFG_PHYLPC            (1 << 15) /* Bit 15: PHY low-power clock select */
                                                /* Bit 16: Reserved */
#define OTG_GUSBCFG_ULPIFSL           (1 << 17) /* Bit 17: ULPI FS/LS select */
#define OTG_GUSBCFG_ULPIAR            (1 << 18) /* Bit 18: ULPI Auto-resume */
#define OTG_GUSBCFG_ULPICSM           (1 << 19) /* Bit 19: ULPI clock SuspendM */
#define OTG_GUSBCFG_ULPIEVBUSD        (1 << 20) /* Bit 20: ULPI external VBUS drive */
#define OTG_GUSBCFG_ULPIEVBUSI        (1 << 21) /* Bit 21: ULPI external VBUS indicator */
#define OTG_GUSBCFG_TSPDS             (1 << 22) /* Bit 22: TermSel DLine pulsing selection */
#define OTG_GUSBCFG_PCCI              (1 << 23) /* Bit 23: Indicator complement */
#define OTG_GUSBCFG_PTCI              (1 << 24) /* Bit 24: Indicator pass through */
#define OTG_GUSBCFG_ULPIIPD           (1 << 25) /* Bit 25: ULPI interface protect disable */
#define OTG_GUSBCFG_FHMOD             (1 << 29) /* Bit 29: Force host mode */
#define OTG_GUSBCFG_FDMOD             (1 << 30) /* Bit 30: Force device mode */
                                                /* Bit 31: Reserved */

/* Reset register */

#define OTG_GRSTCTL_CSRST             (1 << 0)                          /* Bit 0: Core soft reset */
#define OTG_GRSTCTL_PSRST             (1 << 1)                          /* Bit 1: Partial soft reset */
                                                                        /* Bits 2-3 Reserved */
#define OTG_GRSTCTL_RXFFLSH           (1 << 4)                          /* Bit 4: RxFIFO flush */
#define OTG_GRSTCTL_TXFFLSH           (1 << 5)                          /* Bit 5: TxFIFO flush */
#define OTG_GRSTCTL_TXFNUM_SHIFT      (6)                               /* Bits 6-10: TxFIFO number */
#define OTG_GRSTCTL_TXFNUM_MASK       (31 << OTG_GRSTCTL_TXFNUM_SHIFT)
#  define OTG_GRSTCTL_TXFNUM_HNONPER  (0 << OTG_GRSTCTL_TXFNUM_SHIFT)   /* Non-periodic TxFIFO flush in host mode */
#  define OTG_GRSTCTL_TXFNUM_HPER     (1 << OTG_GRSTCTL_TXFNUM_SHIFT)   /* Periodic TxFIFO flush in host mode */
#  define OTG_GRSTCTL_TXFNUM_HALL     (16 << OTG_GRSTCTL_TXFNUM_SHIFT)  /* Flush all the transmit FIFOs in host mode.*/
#  define OTG_GRSTCTL_TXFNUM_D(n)     ((n) << OTG_GRSTCTL_TXFNUM_SHIFT) /* TXFIFO n flush in device mode, n=0-15 */
#  define OTG_GRSTCTL_TXFNUM_DALL     (16 << OTG_GRSTCTL_TXFNUM_SHIFT)  /* Flush all the transmit FIFOs in device mode.*/
                                                                        /* Bits 11-29: Reserved */
#define OTG_GRSTCTL_DMAREQ            (1 << 30)                         /* Bit 30: DMA request signal enabled */
#define OTG_GRSTCTL_AHBIDL            (1 << 31)                         /* Bit 31: AHB master idle */

/* Core interrupt and Interrupt mask registers */

#define OTG_GINTSTS_CMOD              (1 << 0)  /* Bit 0:  Current mode of operation */
#  define OTG_GINTSTS_DEVMODE         (0)
#  define OTG_GINTSTS_HOSTMODE        (OTG_GINTSTS_CMOD)
#define OTG_GINT_MMIS                 (1 << 1)  /* Bit 1:  Mode mismatch interrupt */
#define OTG_GINT_OTG                  (1 << 2)  /* Bit 2:  OTG interrupt */
#define OTG_GINT_SOF                  (1 << 3)  /* Bit 3:  Start of frame */
#define OTG_GINT_RXFLVL               (1 << 4)  /* Bit 4:  RxFIFO non-empty */
#define OTG_GINT_NPTXFE               (1 << 5)  /* Bit 5:  Non-periodic TxFIFO empty */
#define OTG_GINT_GINAKEFF             (1 << 6)  /* Bit 6:  Global IN non-periodic NAK effective */
#define OTG_GINT_GONAKEFF             (1 << 7)  /* Bit 7:  Global OUT NAK effective */
                                                /* Bits 8-9: Reserved */
#define OTG_GINT_ESUSP                (1 << 10) /* Bit 10: Early suspend */
#define OTG_GINT_USBSUSP              (1 << 11) /* Bit 11: USB suspend */
#define OTG_GINT_USBRST               (1 << 12) /* Bit 12: USB reset */
#define OTG_GINT_ENUMDNE              (1 << 13) /* Bit 13: Enumeration done */
#define OTG_GINT_ISOODRP              (1 << 14) /* Bit 14: Isochronous OUT packet dropped interrupt */
#define OTG_GINT_EOPF                 (1 << 15) /* Bit 15: End of periodic frame interrupt */
                                                /* Bits 16-17 Reserved */
#define OTG_GINT_IEP                  (1 << 18) /* Bit 18: IN endpoint interrupt */
#define OTG_GINT_OEP                  (1 << 19) /* Bit 19: OUT endpoint interrupt */
#define OTG_GINT_IISOIXFR             (1 << 20) /* Bit 20: Incomplete isochronous IN transfer */
#define OTG_GINT_IISOOXFR             (1 << 21) /* Bit 21: Incomplete isochronous OUT transfer (device) */
#define OTG_GINT_IPXFR                (1 << 21) /* Bit 21: Incomplete periodic transfer (host) */
#define OTG_GINT_DATAFSUSP            (1 << 22) /* Bit 22: Data fetch sispended */
#define OTG_GINT_RSTDET               (1 << 23) /* Bit 23: Reset detected interrupt */
#define OTG_GINT_HPRT                 (1 << 24) /* Bit 24: Host port interrupt */
#define OTG_GINT_HC                   (1 << 25) /* Bit 25: Host channels interrupt */
#define OTG_GINT_PTXFE                (1 << 26) /* Bit 26: Periodic TxFIFO empty */
#define OTG_GINT_LPMINT               (1 << 27) /* Bit 27: LPM interrupt */
#define OTG_GINT_CIDSCHG              (1 << 28) /* Bit 28: Connector ID status change */
#define OTG_GINT_DISC                 (1 << 29) /* Bit 29: Disconnect detected interrupt */
#define OTG_GINT_SRQ                  (1 << 30) /* Bit 30: Session request/new session detected interrupt */
#define OTG_GINT_WKUP                 (1 << 31) /* Bit 31: Resume/remote wakeup detected interrupt */
#define OTG_GINT_RESERVED             ((1 << 8) | (1 << 9) | (1 << 16) | (1 << 17))

/* Receive status debug read/OTG status read and pop registers (host mode) */

#define OTG_GRXSTSH_CHNUM_SHIFT       (0)                             /* Bits 0-3: Channel number */
#define OTG_GRXSTSH_CHNUM_MASK        (15 << OTG_GRXSTSH_CHNUM_SHIFT)
#define OTG_GRXSTSH_BCNT_SHIFT        (4)                             /* Bits 4-14: Byte count */
#define OTG_GRXSTSH_BCNT_MASK         (0x7ff << OTG_GRXSTSH_BCNT_SHIFT)
#define OTG_GRXSTSH_DPID_SHIFT        (15)                            /* Bits 15-16: Data PID */
#define OTG_GRXSTSH_DPID_MASK         (3 << OTG_GRXSTSH_DPID_SHIFT)
#  define OTG_GRXSTSH_DPID_DATA0      (0 << OTG_GRXSTSH_DPID_SHIFT)
#  define OTG_GRXSTSH_DPID_DATA2      (1 << OTG_GRXSTSH_DPID_SHIFT)
#  define OTG_GRXSTSH_DPID_DATA1      (2 << OTG_GRXSTSH_DPID_SHIFT)
#  define OTG_GRXSTSH_DPID_MDATA      (3 << OTG_GRXSTSH_DPID_SHIFT)
#define OTG_GRXSTSH_PKTSTS_SHIFT      (17)                            /* Bits 17-20: Packet status */
#define OTG_GRXSTSH_PKTSTS_MASK       (15 << OTG_GRXSTSH_PKTSTS_SHIFT)
#  define OTG_GRXSTSH_PKTSTS_INRECVD  (2 << OTG_GRXSTSH_PKTSTS_SHIFT) /* IN data packet received */
#  define OTG_GRXSTSH_PKTSTS_INDONE   (3 << OTG_GRXSTSH_PKTSTS_SHIFT) /* IN transfer completed */
#  define OTG_GRXSTSH_PKTSTS_DTOGERR  (5 << OTG_GRXSTSH_PKTSTS_SHIFT) /* Data toggle error */
#  define OTG_GRXSTSH_PKTSTS_HALTED   (7 << OTG_GRXSTSH_PKTSTS_SHIFT) /* Channel halted */
                                                                      /* Bits 21-31: Reserved */

/* Receive status debug read/OTG status read and pop registers
 * (device mode)
 */

