ImBonkers/nuttx/arch/arm/src/stm32n6/hardware/stm32n6xxx_otg.h
#define OTG_GRXSTSD_EPNUM_SHIFT         (0)                             /* Bits 0-3: Endpoint number */
#define OTG_GRXSTSD_EPNUM_MASK          (15 << OTG_GRXSTSD_EPNUM_SHIFT)
#define OTG_GRXSTSD_BCNT_SHIFT          (4)                             /* Bits 4-14: Byte count */
#define OTG_GRXSTSD_BCNT_MASK           (0x7ff << OTG_GRXSTSD_BCNT_SHIFT)
#define OTG_GRXSTSD_DPID_SHIFT          (15)                            /* Bits 15-16: Data PID */
#define OTG_GRXSTSD_DPID_MASK           (3 << OTG_GRXSTSD_DPID_SHIFT)
#  define OTG_GRXSTSD_DPID_DATA0        (0 << OTG_GRXSTSD_DPID_SHIFT)
#  define OTG_GRXSTSD_DPID_DATA2        (1 << OTG_GRXSTSD_DPID_SHIFT)
#  define OTG_GRXSTSD_DPID_DATA1        (2 << OTG_GRXSTSD_DPID_SHIFT)
#  define OTG_GRXSTSD_DPID_MDATA        (3 << OTG_GRXSTSD_DPID_SHIFT)
#define OTG_GRXSTSD_PKTSTS_SHIFT        (17)                            /* Bits 17-20: Packet status */
#define OTG_GRXSTSD_PKTSTS_MASK         (15 << OTG_GRXSTSD_PKTSTS_SHIFT)
#  define OTG_GRXSTSD_PKTSTS_OUTNAK     (1 << OTG_GRXSTSD_PKTSTS_SHIFT) /* Global OUT NAK */
#  define OTG_GRXSTSD_PKTSTS_OUTRECVD   (2 << OTG_GRXSTSD_PKTSTS_SHIFT) /* OUT data packet received */
#  define OTG_GRXSTSD_PKTSTS_OUTDONE    (3 << OTG_GRXSTSD_PKTSTS_SHIFT) /* OUT transfer completed */
#  define OTG_GRXSTSD_PKTSTS_SETUPDONE  (4 << OTG_GRXSTSD_PKTSTS_SHIFT) /* SETUP transaction completed */
#  define OTG_GRXSTSD_PKTSTS_SETUPRECVD (6 << OTG_GRXSTSD_PKTSTS_SHIFT) /* SETUP data packet received */
#define OTG_GRXSTSD_FRMNUM_SHIFT        (21)                            /* Bits 21-24: Frame number */
#define OTG_GRXSTSD_FRMNUM_MASK         (15 << OTG_GRXSTSD_FRMNUM_SHIFT)
                                                                        /* Bits 25-26: Reserved */
#define OTG_GRXSTSH_STSPHST             (17)                            /* Bit 27: Status phase start */
                                                                        /* Bits 28-31: Reserved */

/* Receive FIFO size register */

#define OTG_GRXFSIZ_MASK              (0xffff)

/* Host non-periodic transmit FIFO size register */

#define OTG_HNPTXFSIZ_NPTXFSA_SHIFT   (0)       /* Bits 0-15: Non-periodic transmit RAM start address */
#define OTG_HNPTXFSIZ_NPTXFSA_MASK    (0xffff << OTG_HNPTXFSIZ_NPTXFSA_SHIFT)
#define OTG_HNPTXFSIZ_NPTXFD_SHIFT    (16)      /* Bits 16-31: Non-periodic TxFIFO depth */
#define OTG_HNPTXFSIZ_NPTXFD_MASK     (0xffff << OTG_HNPTXFSIZ_NPTXFD_SHIFT)
#  define OTG_HNPTXFSIZ_NPTXFD_MIN    (16 << OTG_HNPTXFSIZ_NPTXFD_SHIFT)
#  define OTG_HNPTXFSIZ_NPTXFD_MAX    (256 << OTG_HNPTXFSIZ_NPTXFD_SHIFT)

/* Endpoint 0 Transmit FIFO size */

#define OTG_DIEPTXF0_TX0FD_SHIFT      (0)       /* Bits 0-15: Endpoint 0 transmit RAM start address */
#define OTG_DIEPTXF0_TX0FD_MASK       (0xffff << OTG_DIEPTXF0_TX0FD_SHIFT)
#define OTG_DIEPTXF0_TX0FSA_SHIFT     (16)      /* Bits 16-31: Endpoint 0 TxFIFO depth */
#define OTG_DIEPTXF0_TX0FSA_MASK      (0xffff << OTG_DIEPTXF0_TX0FSA_SHIFT)
#  define OTG_DIEPTXF0_TX0FSA_MIN     (16 << OTG_DIEPTXF0_TX0FSA_SHIFT)
#  define OTG_DIEPTXF0_TX0FSA_MAX     (256 << OTG_DIEPTXF0_TX0FSA_SHIFT)

/* Non-periodic transmit FIFO/queue status register */

#define OTG_HNPTXSTS_NPTXFSAV_SHIFT   (0)                            /* Bits 0-15: Non-periodic TxFIFO space available */
#define OTG_HNPTXSTS_NPTXFSAV_MASK    (0xffff << OTG_HNPTXSTS_NPTXFSAV_SHIFT)
#  define OTG_HNPTXSTS_NPTXFSAV_FULL  (0 << OTG_HNPTXSTS_NPTXFSAV_SHIFT)
#define OTG_HNPTXSTS_NPTQXSAV_SHIFT   (16)                           /* Bits 16-23: Non-periodic transmit request queue space available */
#define OTG_HNPTXSTS_NPTQXSAV_MASK    (0xff << OTG_HNPTXSTS_NPTQXSAV_SHIFT)
#  define OTG_HNPTXSTS_NPTQXSAV_FULL  (0 << OTG_HNPTXSTS_NPTQXSAV_SHIFT)
#define OTG_HNPTXSTS_NPTXQTOP_SHIFT   (24)                           /* Bits 24-30: Top of the non-periodic transmit request queue */
#define OTG_HNPTXSTS_NPTXQTOP_MASK    (0x7f << OTG_HNPTXSTS_NPTXQTOP_SHIFT)
#  define OTG_HNPTXSTS_TERMINATE      (1 << 24)                      /* Bit 24: Terminate (last entry for selected channel/endpoint) */
#  define OTG_HNPTXSTS_TYPE_SHIFT     (25)                           /* Bits 25-26: Status */
#  define OTG_HNPTXSTS_TYPE_MASK      (3 << OTG_HNPTXSTS_TYPE_SHIFT)
#    define OTG_HNPTXSTS_TYPE_INOUT   (0 << OTG_HNPTXSTS_TYPE_SHIFT) /* IN/OUT token */
#    define OTG_HNPTXSTS_TYPE_ZLP     (1 << OTG_HNPTXSTS_TYPE_SHIFT) /* Zero-length transmit packet (device IN/host OUT) */
#    define OTG_HNPTXSTS_TYPE_HALT    (3 << OTG_HNPTXSTS_TYPE_SHIFT) /* Channel halt command */
#  define OTG_HNPTXSTS_CHNUM_SHIFT    (27)                           /* Bits 27-30: Channel number */
#  define OTG_HNPTXSTS_CHNUM_MASK     (15 << OTG_HNPTXSTS_CHNUM_SHIFT)
#  define OTG_HNPTXSTS_EPNUM_SHIFT    (27)                           /* Bits 27-30: Endpoint number */
#  define OTG_HNPTXSTS_EPNUM_MASK     (15 << OTG_HNPTXSTS_EPNUM_SHIFT)
                                                                     /* Bit 31 Reserved */

/* General core configuration register */

#define OTG_GCCFG_DCDET               (1 << 0)  /* Bit 0: Data contact detection (DCD) status */
#define OTG_GCCFG_PDET                (1 << 1)  /* Bit 1: Primary detection (PD) status */
#define OTG_GCCFG_SDET                (1 << 2)  /* Bit 2: Secondary detection (SD) status */
#define OTG_GCCFG_PS2DET              (1 << 3)  /* Bit 3: DM pull-up detection status */
                                                /* Bits 4-15: Reserved */
#define OTG_GCCFG_PWRDWN              (1 << 16) /* Bit 16: Power down */
#define OTG_GCCFG_BCDEN               (1 << 17) /* Bit 17: Battery charging detector (BCD) enable */
#define OTG_GCCFG_DCDEN               (1 << 18) /* Bit 18: Data contact detection (DCD) mode enable */
#define OTG_GCCFG_PDEN                (1 << 19) /* Bit 19: Primary detection (PD) mode enable */
#define OTG_GCCFG_SDEN                (1 << 20) /* Bit 20: Secondary detection (SD) mode enable */
#define OTG_GCCFG_VBDEN               (1 << 21) /* Bit 21: USB VBUS detection enable */
                                                /* Bits 22-31: Reserved */

/* TODO: OTG core LPM configuration register */

