ImBonkers/nuttx/arch/arm/src/stm32n6/hardware/stm32n6xxx_otg.h
#define OTG_DOEPMSK_XFRCM             (1 << 0)  /* Bit 0: Transfer completed interrupt mask */
#define OTG_DOEPMSK_EPDM              (1 << 1)  /* Bit 1: Endpoint disabled interrupt mask */
#define OTG_DOEPMSK_AHBERR            (1 << 2)  /* Bit 2: AHB error */
#define OTG_DOEPMSK_STUPM             (1 << 3)  /* Bit 3: SETUP phase done mask */
#define OTG_DOEPMSK_OTEPDM            (1 << 4)  /* Bit 4: OUT token received when endpoint disabled mask */
#define OTG_DOEPMSK_STSPHSRXM         (1 << 5)  /* Bit 5: Status phase received for control write mask */
#define OTG_DOEPMSK_B2BSTUPM          (1 << 6)  /* Bit 6: Back-to-back SETUP packets received mask */
                                                /* Bit 7: Reserved */
#define OTG_DOEPMSK_OUTPKTERRM        (1 << 8)  /* Bit 8: Out packet error mask */
                                                /* Bits 9-11: Reserved */
#define OTG_DOEPMSK_BERR              (1 << 12) /* Bit 12: Babble error interrupt mask */
#define OTG_DOEPMSK_NAK               (1 << 13) /* Bit 13: NAK interrupt mask */
#define OTG_DOEPMSK_NYET              (1 << 14) /* Bit 14: NYET interrupt mask */
                                                /* Bits 15-31: Reserved */

/* Device all endpoints interrupt and All endpoints interrupt mask
 * registers
 */

#define OTG_DAINT_IEP_SHIFT           (0)      /* Bits 0-15: IN endpoint interrupt bits */
#define OTG_DAINT_IEP_MASK            (0xffff << OTG_DAINT_IEP_SHIFT)
#  define OTG_DAINT_IEP(n)            (1 << (n))
#define OTG_DAINT_OEP_SHIFT           (16)      /* Bits 16-31: OUT endpoint interrupt bits */
#define OTG_DAINT_OEP_MASK            (0xffff << OTG_DAINT_OEP_SHIFT)
#  define OTG_DAINT_OEP(n)            (1 << ((n)+16))

/* Device VBUS discharge time register */

#define OTG_DVBUSDIS_MASK             (0xffff)

/* Device VBUS pulsing time register */

#define OTG_DVBUSPULSE_MASK           (0xfff)

/* TODO: OTG device threshold control register */

/* Device IN endpoint FIFO empty interrupt mask register */

#define OTG_DIEPEMPMSK(n)             (1 << (n))

/* TODO: OTG device each endpoint interrupt register */

/* TODO: OTG device each endpoint-1 interrupt */

/* Device control IN endpoint n control register */

#define OTG_DIEPCTL_MPSIZ_SHIFT       (0)                            /* Bits 0-10: Maximum packet size */
#define OTG_DIEPCTL_MPSIZ_MASK        (0x7ff << OTG_DIEPCTL_MPSIZ_SHIFT)
                                                                     /* Bits 11-14: Reserved */
#define OTG_DIEPCTL_USBAEP            (1 << 15)                      /* Bit 15: USB active endpoint */
#define OTG_DIEPCTL_EONUM             (1 << 16)                      /* Bit 16: Even/odd frame */
#  define OTG_DIEPCTL_EVEN            (0)
#  define OTG_DIEPCTL_ODD             OTG_DIEPCTL_EONUM
#  define OTG_DIEPCTL_DATA0           (0)
#  define OTG_DIEPCTL_DATA1           OTG_DIEPCTL_EONUM
#define OTG_DIEPCTL_NAKSTS            (1 << 17)                      /* Bit 17: NAK status */
#define OTG_DIEPCTL_EPTYP_SHIFT       (18)                           /* Bits 18-19: Endpoint type */
#define OTG_DIEPCTL_EPTYP_MASK        (3 << OTG_DIEPCTL_EPTYP_SHIFT)
#  define OTG_DIEPCTL_EPTYP_CTRL      (0 << OTG_DIEPCTL_EPTYP_SHIFT) /* Control */
#  define OTG_DIEPCTL_EPTYP_ISOC      (1 << OTG_DIEPCTL_EPTYP_SHIFT) /* Isochronous */
#  define OTG_DIEPCTL_EPTYP_BULK      (2 << OTG_DIEPCTL_EPTYP_SHIFT) /* Bulk */
#  define OTG_DIEPCTL_EPTYP_INTR      (3 << OTG_DIEPCTL_EPTYP_SHIFT) /* Interrupt */
                                                                     /* Bit 20: Reserved */
#define OTG_DIEPCTL_STALL             (1 << 21)                      /* Bit 21: STALL handshake */
#define OTG_DIEPCTL_TXFNUM_SHIFT      (22)                           /* Bits 22-25: TxFIFO number */
#define OTG_DIEPCTL_TXFNUM_MASK       (15 << OTG_DIEPCTL_TXFNUM_SHIFT)
#define OTG_DIEPCTL_CNAK              (1 << 26)                      /* Bit 26: Clear NAK */
#define OTG_DIEPCTL_SNAK              (1 << 27)                      /* Bit 27: Set NAK */
#define OTG_DIEPCTL_SD0PID            (1 << 28)                      /* Bit 28: Set DATA0 PID (interrupt/bulk) */
#define OTG_DIEPCTL_SEVNFRM           (1 << 28)                      /* Bit 28: Set even frame (isochronous)) */
#define OTG_DIEPCTL_SODDFRM           (1 << 29)                      /* Bit 29: Set odd frame (isochronous) */
#define OTG_DIEPCTL_EPDIS             (1 << 30)                      /* Bit 30: Endpoint disable */
#define OTG_DIEPCTL_EPENA             (1 << 31)                      /* Bit 31: Endpoint enable */

/* Device endpoint-n interrupt register */

#define OTG_DIEPINT_XFRC              (1 << 0)  /* Bit 0: Transfer completed interrupt */
#define OTG_DIEPINT_EPDISD            (1 << 1)  /* Bit 1: Endpoint disabled interrupt */
#define OTG_DIEPINT_AHBERR            (1 << 2)  /* Bit 2: AHB error */
#define OTG_DIEPINT_TOC               (1 << 3)  /* Bit 3: Timeout condition */
#define OTG_DIEPINT_ITTXFE            (1 << 4)  /* Bit 4: IN token received when TxFIFO is empty */
#define OTG_DIEPINT_INEPNM            (1 << 5)  /* Bit 5: */
#define OTG_DIEPINT_INEPNE            (1 << 6)  /* Bit 6: IN endpoint NAK effective */
#define OTG_DIEPINT_TXFE              (1 << 7)  /* Bit 7: Transmit FIFO empty */
#define OTG_DIEPINT_TXFIFOUDRN        (1 << 8)  /* Bit 8: Transmit FIFO underrun */
                                                /* Bits 9-10: Reserved */
#define OTG_DIEPINT_PKTDRPSTS         (1 << 11) /* Bit 11: Packet dropped status */
                                                /* Bit 12: Reserved */
#define OTG_DIEPINT_NAK               (1 << 13) /* Bit 13: NAK input */
                                                /* Bits 14-31: Reserved */

/* Device IN endpoint 0 transfer size register */

#define OTG_DIEPTSIZ0_XFRSIZ_SHIFT    (0)         /* Bits 0-6: Transfer size */
#define OTG_DIEPTSIZ0_XFRSIZ_MASK     (0x7f << OTG_DIEPTSIZ0_XFRSIZ_SHIFT)
                                                  /* Bits 7-18: Reserved, must be kept at reset value */
#define OTG_DIEPTSIZ0_PKTCNT_SHIFT    (19)        /* Bits 19-20: Packet count */
#define OTG_DIEPTSIZ0_PKTCNT_MASK     (3 << OTG_DIEPTSIZ0_PKTCNT_SHIFT)
                                                  /* Bits 21-31: Reserved, must be kept at reset value */

/* Device IN endpoint n transfer size register */

#define OTG_DIEPTSIZ_XFRSIZ_SHIFT     (0)         /* Bits 0-18: Transfer size */
#define OTG_DIEPTSIZ_XFRSIZ_MASK      (0x7ffff << OTG_DIEPTSIZ_XFRSIZ_SHIFT)
#define OTG_DIEPTSIZ_PKTCNT_SHIFT     (19)        /* Bit 19-28: Packet count */
#define OTG_DIEPTSIZ_PKTCNT_MASK      (0x3ff << OTG_DIEPTSIZ_PKTCNT_SHIFT)
#define OTG_DIEPTSIZ_MCNT_SHIFT       (29)        /* Bits 29-30: Multi count */
#define OTG_DIEPTSIZ_MCNT_MASK        (3 << OTG_DIEPTSIZ_MCNT_SHIFT)
                                                  /* Bit 31: Reserved */

/* Device OUT endpoint TxFIFO status register */

#define OTG_DTXFSTS_MASK              (0xffff)

