ImBonkers/nuttx/arch/arm/src/stm32n6/hardware/stm32n6xxx_otg.h
/* Device OUT endpoint 0 control register */

#define OTG_DOEPCTL0_MPSIZ_SHIFT      (0)                             /* Bits 0-1: Maximum packet size */
#define OTG_DOEPCTL0_MPSIZ_MASK       (3 << OTG_DOEPCTL0_MPSIZ_SHIFT)
#  define OTG_DOEPCTL0_MPSIZ_64       (0 << OTG_DOEPCTL0_MPSIZ_SHIFT) /* 64 bytes */
#  define OTG_DOEPCTL0_MPSIZ_32       (1 << OTG_DOEPCTL0_MPSIZ_SHIFT) /* 32 bytes */
#  define OTG_DOEPCTL0_MPSIZ_16       (2 << OTG_DOEPCTL0_MPSIZ_SHIFT) /* 16 bytes */
#  define OTG_DOEPCTL0_MPSIZ_8        (3 << OTG_DOEPCTL0_MPSIZ_SHIFT) /* 8 bytes */
                                                                      /* Bits 2-14: Reserved */
#define OTG_DOEPCTL0_USBAEP           (1 << 15)                       /* Bit 15: USB active endpoint */
                                                                      /* Bit 16: Reserved */
#define OTG_DOEPCTL0_NAKSTS           (1 << 17)                       /* Bit 17: NAK status */
#define OTG_DOEPCTL0_EPTYP_SHIFT      (18)                            /* Bits 18-19: Endpoint type */
#define OTG_DOEPCTL0_EPTYP_MASK       (3 << OTG_DOEPCTL0_EPTYP_SHIFT)
#  define OTG_DOEPCTL0_EPTYP_CTRL     (0 << OTG_DOEPCTL0_EPTYP_SHIFT) /* Control (hard-coded) */
#define OTG_DOEPCTL0_SNPM             (1 << 20)                       /* Bit 20: Snoop mode */
#define OTG_DOEPCTL0_STALL            (1 << 21)                       /* Bit 21: STALL handshake */
                                                                      /* Bits 22-25: Reserved */
#define OTG_DOEPCTL0_CNAK             (1 << 26)                       /* Bit 26: Clear NAK */
#define OTG_DOEPCTL0_SNAK             (1 << 27)                       /* Bit 27: Set NAK */
                                                                      /* Bits 28-29: Reserved */
#define OTG_DOEPCTL0_EPDIS            (1 << 30)                       /* Bit 30: Endpoint disable */
#define OTG_DOEPCTL0_EPENA            (1 << 31)                       /* Bit 31: Endpoint enable */

/* Device OUT endpoint n control register */

#define OTG_DOEPCTL_MPSIZ_SHIFT       (0)                            /* Bits 0-10: Maximum packet size */
#define OTG_DOEPCTL_MPSIZ_MASK        (0x7ff << OTG_DOEPCTL_MPSIZ_SHIFT)
                                                                     /* Bits 11-14: Reserved */
#define OTG_DOEPCTL_USBAEP            (1 << 15)                      /* Bit 15: USB active endpoint */
#define OTG_DOEPCTL_DPID              (1 << 16)                      /* Bit 16: Endpoint data PID (interrupt/bulk) */
#  define OTG_DOEPCTL_DATA0           (0)
#  define OTG_DOEPCTL_DATA1           OTG_DOEPCTL_DPID
#define OTG_DOEPCTL_EONUM             (1 << 16)                      /* Bit 16: Even/odd frame (isochronous) */
#  define OTG_DOEPCTL_EVEN            (0)
#  define OTG_DOEPCTL_ODD             OTG_DOEPCTL_EONUM
#define OTG_DOEPCTL_NAKSTS            (1 << 17)                      /* Bit 17: NAK status */
#define OTG_DOEPCTL_EPTYP_SHIFT       (18)                           /* Bits 18-19: Endpoint type */
#define OTG_DOEPCTL_EPTYP_MASK        (3 << OTG_DOEPCTL_EPTYP_SHIFT)
#  define OTG_DOEPCTL_EPTYP_CTRL      (0 << OTG_DOEPCTL_EPTYP_SHIFT) /* Control */
#  define OTG_DOEPCTL_EPTYP_ISOC      (1 << OTG_DOEPCTL_EPTYP_SHIFT) /* Isochronous */
#  define OTG_DOEPCTL_EPTYP_BULK      (2 << OTG_DOEPCTL_EPTYP_SHIFT) /* Bulk */
#  define OTG_DOEPCTL_EPTYP_INTR      (3 << OTG_DOEPCTL_EPTYP_SHIFT) /* Interrupt */
#define OTG_DOEPCTL_SNPM              (1 << 20)                      /* Bit 20: Snoop mode */
#define OTG_DOEPCTL_STALL             (1 << 21)                      /* Bit 21: STALL handshake */
                                                                     /* Bits 22-25: Reserved */
#define OTG_DOEPCTL_CNAK              (1 << 26)                      /* Bit 26: Clear NAK */
#define OTG_DOEPCTL_SNAK              (1 << 27)                      /* Bit 27: Set NAK */
#define OTG_DOEPCTL_SD0PID            (1 << 28)                      /* Bit 28: Set DATA0 PID (interrupt/bulk) */
#define OTG_DOEPCTL_SEVNFRM           (1 << 28)                      /* Bit 28: Set even frame (isochronous) */
#define OTG_DOEPCTL_SD1PID            (1 << 29)                      /* Bit 29: Set DATA1 PID (interrupt/bulk) */
#define OTG_DOEPCTL_SODDFRM           (1 << 29)                      /* Bit 29: Set odd frame (isochronous */
#define OTG_DOEPCTL_EPDIS             (1 << 30)                      /* Bit 30: Endpoint disable */
#define OTG_DOEPCTL_EPENA             (1 << 31)                      /* Bit 31: Endpoint enable */

/* Device endpoint-n interrupt register */

#define OTG_DOEPINT_XFRC              (1 << 0)  /* Bit 0: Transfer completed interrupt */
#define OTG_DOEPINT_EPDISD            (1 << 1)  /* Bit 1: Endpoint disabled interrupt */
#define OTG_DOEPINT_AHBERR            (1 << 2)  /* Bit 2: AHB error */
#define OTG_DOEPINT_SETUP             (1 << 3)  /* Bit 3: SETUP phase done */
#define OTG_DOEPINT_OTEPDIS           (1 << 4)  /* Bit 4: OUT token received when endpoint disabled */
#define OTG_DOEPINT_STSPHSRXM         (1 << 5)  /* Bit 5: Status phase received for control write mask */
#define OTG_DOEPINT_B2BSTUP           (1 << 6)  /* Bit 6: Back-to-back SETUP packets received */
                                                /* Bit 7: Reserved */
#define OTG_DOEPINT_OUTPKTERRM        (1 << 8)  /* Bit 8: Out packet error mask */
                                                /* Bits 9-11: Reserved */
#define OTG_DOEPINT_BERR              (1 << 12) /* Bit 12: Babble error interrupt mask */
#define OTG_DOEPINT_NAK               (1 << 13) /* Bit 13: NAK interrupt mask */
#define OTG_DOEPINT_NYET              (1 << 14) /* Bit 14: NYET interrupt mask */
#define OTG_DOEPINT_STUPPKTRCVD       (1 << 15) /* Bit 15: SETUP packet received (DMA only) */
                                                /* Bits 16-31: Reserved */

/* Device OUT endpoint-0 transfer size register */

