ImBonkers/nuttx/arch/arm/src/stm32n6/hardware/stm32n6xxx_otg.h
#define OTG_DOEPTSIZ0_XFRSIZ_SHIFT    (0)       /* Bits 0-6: Transfer size */
#define OTG_DOEPTSIZ0_XFRSIZ_MASK     (0x7f << OTG_DOEPTSIZ0_XFRSIZ_SHIFT)
                                                /* Bits 7-18: Reserved */
#define OTG_DOEPTSIZ0_PKTCNT          (1 << 19) /* Bit 19 PKTCNT: Packet count */
                                                /* Bits 20-28: Reserved */
#define OTG_DOEPTSIZ0_STUPCNT_SHIFT   (29)      /* Bits 29-30: SETUP packet count */
#define OTG_DOEPTSIZ0_STUPCNT_MASK    (3 << OTG_DOEPTSIZ0_STUPCNT_SHIFT)
                                                /* Bit 31: Reserved */

/* Device OUT endpoint-n transfer size register */

#define OTG_DOEPTSIZ_XFRSIZ_SHIFT     (0)       /* Bits 0-18: Transfer size */
#define OTG_DOEPTSIZ_XFRSIZ_MASK      (0x7ffff << OTG_DOEPTSIZ_XFRSIZ_SHIFT)
#define OTG_DOEPTSIZ_PKTCNT_SHIFT     (19)      /* Bit 19-28: Packet count */
#define OTG_DOEPTSIZ_PKTCNT_MASK      (0x3ff << OTG_DOEPTSIZ_PKTCNT_SHIFT)
#define OTG_DOEPTSIZ_STUPCNT_SHIFT    (29)      /* Bits 29-30: SETUP packet count */
#define OTG_DOEPTSIZ_STUPCNT_MASK     (3 << OTG_DOEPTSIZ_STUPCNT_SHIFT)
#define OTG_DOEPTSIZ_RXDPID_SHIFT     (29)      /* Bits 29-30: Received data PID */
#define OTG_DOEPTSIZ_RXDPID_MASK      (3 << OTG_DOEPTSIZ_RXDPID_SHIFT)
#  define OTG_DOEPTSIZ_RXDPID_DATA0   (0 << OTG_DOEPTSIZ_RXDPID_SHIFT)
#  define OTG_DOEPTSIZ_RXDPID_DATA2   (1 << OTG_DOEPTSIZ_RXDPID_SHIFT)
#  define OTG_DOEPTSIZ_RXDPID_DATA1   (2 << OTG_DOEPTSIZ_RXDPID_SHIFT)
#  define OTG_DOEPTSIZ_RXDPID_MDATA   (3 << OTG_DOEPTSIZ_RXDPID_SHIFT)
                                                /* Bit 31: Reserved */

/* DMA Descriptor Status Word (Descriptor DMA mode, DCFG.DESCDMA=1) */

#define OTG_DMADESC_BS_HREADY         (0u << 30)  /* Host Ready */
#define OTG_DMADESC_BS_DMABUSY        (1u << 30)  /* DMA Busy */
#define OTG_DMADESC_BS_DMADONE        (2u << 30)  /* DMA Done */
#define OTG_DMADESC_BS_HBUSY          (3u << 30)  /* Host Busy (arm for DMA) */
#define OTG_DMADESC_BS_MASK           (3u << 30)
#define OTG_DMADESC_STS_SUCC          (0u << 28)  /* Success */
#define OTG_DMADESC_STS_BUFERR        (3u << 28)  /* Buffer Error */
#define OTG_DMADESC_STS_MASK          (3u << 28)
#define OTG_DMADESC_L                 (1u << 27)  /* Last descriptor */
#define OTG_DMADESC_SP                (1u << 26)  /* Short packet */
#define OTG_DMADESC_IOC               (1u << 25)  /* Interrupt on complete */
#define OTG_DMADESC_SR                (1u << 24)  /* SETUP received (EP0 OUT) */
#define OTG_DMADESC_MTRF              (1u << 23)  /* Multi-transfer */
#define OTG_DMADESC_BYTES_MASK        (0xffffu)   /* Byte count [15:0] */

/* Power and clock gating control register */

#define OTG_PCGCCTL_STPPCLK           (1 << 0)  /* Bit 0: Stop PHY clock */
#define OTG_PCGCCTL_GATEHCLK          (1 << 1)  /* Bit 1: Gate HCLK */
                                                /* Bits 2-3: Reserved */
#define OTG_PCGCCTL_PHYSUSP           (1 << 4)  /* Bit 4: PHY Suspended */
#define OTG_PCGCCTL_ENL1GTG           (1 << 5)  /* Bit 5: PHY Suspended */
#define OTG_PCGCCTL_PHYSLEEP          (1 << 6)  /* Bit 6: PHY Suspended */
#define OTG_PCGCCTL_SUSP              (1 << 7)  /* Bit 7: PHY Suspended */
                                                /* Bits 7-31: Reserved */

/* USB HS PHY Controller (USBPHYC) Register Offsets *************************/

#define STM32_USBPHYC_CR_OFFSET       0x0000  /* PHY control register */
#define STM32_USBPHYC_TRIM1CR_OFFSET  0x0004  /* PHY trim register 1 */
#define STM32_USBPHYC_TRIM2CR_OFFSET  0x0008  /* PHY trim register 2 */

/* USBPHYC_CR Register Bitfield Definitions (from CMSIS stm32n657xx.h) */

#define USBPHYC_CR_RETENABLEN1        (1 << 0)  /* Bit 0:  Retention mode enable */
#define USBPHYC_CR_AUTORSMENB1        (1 << 1)  /* Bit 1:  Auto-resume mode enable */
#define USBPHYC_CR_CMN                (1 << 2)  /* Bit 2:  Common block power-down in suspend/sleep */
#define USBPHYC_CR_FSEL_SHIFT         (4)       /* Bits 6:4: PHY reference clock frequency select */
#define USBPHYC_CR_FSEL_MASK          (7 << USBPHYC_CR_FSEL_SHIFT)
#  define USBPHYC_CR_FSEL_12MHZ       (0 << USBPHYC_CR_FSEL_SHIFT) /* 12 MHz */
#  define USBPHYC_CR_FSEL_24MHZ       (2 << USBPHYC_CR_FSEL_SHIFT) /* 24 MHz */
#  define USBPHYC_CR_FSEL_48MHZ       (7 << USBPHYC_CR_FSEL_SHIFT) /* 48 MHz */
#define USBPHYC_CR_OTGDISABLE0       (1 << 16)  /* Bit 16: OTG block disable */
#define USBPHYC_CR_DRVVBUS0          (1 << 17)  /* Bit 17: Drive VBUS */

/* STM32N6-specific GCCFG register bits (different from STM32H7!) */

#define OTG_GCCFG_VBVALOVAL_N6       (1 << 23)  /* Bit 23: VBUSVLDEXT value override */
#define OTG_GCCFG_VBVALEXTOEN_N6     (1 << 24)  /* Bit 24: VBUSVLDEXT override enable */
#define OTG_GCCFG_PULLDOWNEN_N6      (1 << 25)  /* Bit 25: Host pulldown resistors enable */

#endif /* __ARCH_ARM_SRC_STM32N6_HARDWARE_STM32N6XXX_OTG_H */
